---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentType
source: html/4f5fb8f8-8e59-19cf-86e6-d2c78ed82e48.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentType Property

"End Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEndAttachmentType { get; }
```